Autodesk.Revit.DB.BooleanOperationsUtils.CutWithHalfSpaceModifyingOriginalSolidInternal(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.SolidOptions)
Modifies the input Solid preserving only the volume on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.
solid:
The input Solid to be cut.
plane:
The cut plane.  The space on the positive side of the normal of the plane will be intersected with the input Solid.
solidOptions:
The optional information to control the properties of the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.BooleanOperationsUtils.CutWithHalfSpaceModifyingOriginalSolidInternal(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Plane)
Modifies the input Solid preserving only the volume on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.
solid:
The input Solid to be cut.
plane:
The cut plane.  The space on the positive side of the normal of the plane will be intersected with the input Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolidInternal(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.BooleanOperationsType,Autodesk.Revit.DB.SolidOptions)
Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Remarks:
This operation modifies the original input Geometry object.
solid0:
The original solid object, can only be the GeometryCreationUtils geometry.
solid1:
The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType:
boolean operation type.
solidOptions:
The optional information to control the properties of the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to perform the Boolean operation for the two solids. This may be due to geometric inaccuracies in the solids, such as slightly misaligned faces or edges.
If so, eliminating the inaccuracies by making sure the solids are accurately aligned may solve the problem. This also may be due to one or both solids having
complexities such as more than two faces geometrically meeting along a single edge, or two coincident edges, etc. Eliminating such conditions, or performing a
sequence of Boolean operations in an order that avoids such conditions, may solve the problem.
Since:
2012

Autodesk.Revit.DB.BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolidInternal(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.BooleanOperationsType)
Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Remarks:
This operation modifies the original input Geometry object.
solid0:
The original solid object, can only be the GeometryCreationUtils geometry.
solid1:
The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType:
boolean operation type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to perform the Boolean operation for the two solids. This may be due to geometric inaccuracies in the solids, such as slightly misaligned faces or edges.
If so, eliminating the inaccuracies by making sure the solids are accurately aligned may solve the problem. This also may be due to one or both solids having
complexities such as more than two faces geometrically meeting along a single edge, or two coincident edges, etc. Eliminating such conditions, or performing a
sequence of Boolean operations in an order that avoids such conditions, may solve the problem.
Since:
2012

Autodesk.Revit.DB.BooleanOperationsUtils.CutWithHalfSpace(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Plane)
Creates a new Solid which is the intersection of the input Solid with the half-space on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.
solid:
The input Solid to be cut.
plane:
The cut plane.  The space on the positive side of the normal of the plane will be intersected with the input Solid.
Returns:
The newly created Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.BooleanOperationsUtils.ExecuteBooleanOperation(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.BooleanOperationsType)
Perform a boolean geometric operation between two solids, and return a new solid to represent the result.
solid0:
The first solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
solid1:
The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType:
boolean operation type.
Returns:
The result geometry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to perform the Boolean operation for the two solids. This may be due to geometric inaccuracies in the solids, such as slightly misaligned faces or edges.
If so, eliminating the inaccuracies by making sure the solids are accurately aligned may solve the problem. This also may be due to one or both solids having
complexities such as more than two faces geometrically meeting along a single edge, or two coincident edges, etc. Eliminating such conditions, or performing a
sequence of Boolean operations in an order that avoids such conditions, may solve the problem.
Since:
2012

Autodesk.Revit.DB.BooleanOperationsUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BooleanOperationsUtils.CutWithHalfSpaceModifyingOriginalSolid(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Plane)
Modifies the input Solid preserving only the volume on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.
Remarks:
This operation modifies the original input Geometry objects.
solid:
The input Solid to be cut. This object cannot be obtained directly from a Revit element.
This means that Autodesk.Revit.DB.GeometryObject.IsElementGeometry cannot be true.
plane:
The cut plane.  The space on the positive side of the normal of the plane will be intersected with the input Solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the original solid object is the geometry of the Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolid(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.BooleanOperationsType)
Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Remarks:
This operation modifies the original input Geometry objects.
solid0:
The original solid object. This object cannot be obtained directly from a Revit element.
This means that Autodesk.Revit.DB.GeometryObject.IsElementGeometry cannot be true.
solid1:
The second solid object. A copy will be taken of the input object, so any solid whether obtained from a Revit element or not would be accepted.
booleanType:
boolean operation type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the original solid object is the geometry of the Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to perform the Boolean operation for the two solids. This may be due to geometric inaccuracies in the solids, such as slightly misaligned faces or edges.
If so, eliminating the inaccuracies by making sure the solids are accurately aligned may solve the problem. This also may be due to one or both solids having
complexities such as more than two faces geometrically meeting along a single edge, or two coincident edges, etc. Eliminating such conditions, or performing a
sequence of Boolean operations in an order that avoids such conditions, may solve the problem."
Since:
2012

Autodesk.Revit.DB.BooleanOperationsUtils
These utilities are applicable for the geometry created by GeometryCreationUtilities and the geometry of Revit model.
Since:
2012